Core/src/Documents/ВозвратДенегОтПФ/ВозвратДенегОтПФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВозвратДенегОтПФ</name>
  <registerRecords>AccumulationRegister.РасчетыНДФЛ</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыПоНалогам</registerRecords>
  <registerRecords>AccumulationRegister.НачисленияИУдержания</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПерсоналом</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПоставщиками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетОрганизации</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУдержанияПФ</name>
    <type>
      <types>CatalogRef.ВидыНачисленийИУдержаний</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДохода</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДФЛ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗачисленнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоговорКонтрагента</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗачисленнаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУдержанияНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>CatalogRef.ВидыНачисленийИУдержаний</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДФЛ</name>
      <comment>(Общ) </comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ТипыДенежныхСредств/ТипыДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДенежныхСредств</name>
  <enumValues>
    <name>Наличные</name>
  </enumValues>
  <enumValues>
    <name>Безналичные</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасходнаяНакладнаяНаличные</name>
  </enumValues>
  <enumValues>
    <name>AzRyРасходнаяНакладнаяБезналичные</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ТипыРасчетов/ТипыРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыРасчетов</name>
  <enumValues>
    <name>Долг</name>
  </enumValues>
  <enumValues>
    <name>Аванс</name>
  </enumValues>
</mdclass:Enum>

Core/src/Enums/ОперацииПФ/ОперацииПФ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОперацииПФ</name>
  <enumValues>
    <name>Начисленный</name>
  </enumValues>
  <enumValues>
    <name>КОплате</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ВозвратДенегОтПФ/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовУНФ.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	Сумма 		= Сотрудники.Итог("ЗачисленнаяСумма")	+ Контрагенты.Итог("ЗачисленнаяСумма");
	СуммаНДФЛ	= Сотрудники.Итог("СуммаНДФЛ") 			+ Контрагенты.Итог("СуммаНДФЛ");
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	Если Не Отказ И НЕ Сумма = 0 Тогда
		ДвиженияПоРегистрам(Отказ);
	КонецЕсли;
	
	ОбработкаПроверкиПравильностиДанных(Отказ);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ЗАПОЛНЕНИЯ ДОКУМЕНТА

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ


Процедура ОбработкаПроверкиПравильностиДанных(Отказ)
	
	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(Отказ)
	
	мВалютаРегламентированногоУчета = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ВалютаУчета");
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВозвратДенегОтПФ.Ссылка КАК Регистратор,
		|	ВозвратДенегОтПФ.Дата КАК Период,
		|	ВозвратДенегОтПФ.Организация,
		|	ВозвратДенегОтПФ.СчетОрганизации,
		|	ВозвратДенегОтПФ.ВидУдержанияПФ,
		|	ВозвратДенегОтПФ.СтатьяДвиженияДенежныхСредств,
		|	ВозвратДенегОтПФ.СчетДохода,
		|	ВозвратДенегОтПФ.ВидУдержанияПФ.Контрагент КАК КонтрагентПФ,
		|	ВозвратДенегОтПФ.ВидУдержанияПФ.Договор КАК ДоговорКонтрагентаПФ,
		|	ВозвратДенегОтПФ.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаРегл КАК СчетНачисленииПФ,
		|	ВозвратДенегОтПФ.ВидУдержанияПФ.ПенсионныйНалогСотрудника.СчетУчетаКВозмещениюРегл КАК СчетУдержанииПФ,
		|	ВозвратДенегОтПФ.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаРегл КАК СчетНачисленииПФОрганизации,
		|	ВозвратДенегОтПФ.ВидУдержанияПФ.ПенсионныйНалогОрганизации.СчетУчетаКВозмещениюРегл КАК СчетУдержанииПФОрганизации,
		|	ВозвратДенегОтПФ.СчетОрганизации.ВалютаДенежныхСредств КАК ВалютаДенежныхСредств,
		|	ВозвратДенегОтПФ.Сумма,
		|	ВЫРАЗИТЬ(ВозвратДенегОтПФ.Сумма / 2 КАК ЧИСЛО(15, 2)) КАК СуммаСотрудника,
		|	ВозвратДенегОтПФ.Сумма - (ВЫРАЗИТЬ(ВозвратДенегОтПФ.Сумма / 2 КАК ЧИСЛО(15, 2))) КАК СуммаОрганизации,
		|	ВозвратДенегОтПФ.СчетОрганизации.СчетУчетаРегл КАК СчетУчетаБанка,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
		|ПОМЕСТИТЬ Шапка
		|ИЗ
		|	Документ.ВозвратДенегОтПФ КАК ВозвратДенегОтПФ
		|ГДЕ
		|	ВозвратДенегОтПФ.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратДенегОтПФСотрудники.Сотрудник,
		|	ВозвратДенегОтПФСотрудники.ВидРасчета,
		|	ВозвратДенегОтПФСотрудники.Подразделение,
		|	ВозвратДенегОтПФСотрудники.ЗачисленнаяСумма,
		|	ВозвратДенегОтПФСотрудники.ВидУдержанияНДФЛ,
		|	ВозвратДенегОтПФСотрудники.СуммаНДФЛ,
		|	ВЫРАЗИТЬ(ВозвратДенегОтПФСотрудники.ЗачисленнаяСумма / 2 КАК ЧИСЛО(15, 2)) КАК СуммаСотрудника,
		|	ВозвратДенегОтПФСотрудники.ЗачисленнаяСумма - (ВЫРАЗИТЬ(ВозвратДенегОтПФСотрудники.ЗачисленнаяСумма / 2 КАК ЧИСЛО(15, 2))) КАК СуммаОрганизации,
		|	ВозвратДенегОтПФСотрудники.СуммаНДФЛ КАК СуммаНДФЛСотрудника,
		|	ВозвратДенегОтПФСотрудники.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК ВидУдержанияНДФЛСчет
		|ПОМЕСТИТЬ Сотрудники
		|ИЗ
		|	Документ.ВозвратДенегОтПФ.Сотрудники КАК ВозвратДенегОтПФСотрудники
		|ГДЕ
		|	ВозвратДенегОтПФСотрудники.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВозвратДенегОтПФКонтрагенты.Контрагент,
		|	ВозвратДенегОтПФКонтрагенты.ДоговорКонтрагента,
		|	ВозвратДенегОтПФКонтрагенты.Подразделение,
		|	ВозвратДенегОтПФКонтрагенты.ЗачисленнаяСумма,
		|	ВозвратДенегОтПФКонтрагенты.ВидУдержанияНДФЛ,
		|	ВозвратДенегОтПФКонтрагенты.СуммаНДФЛ,
		|	ВЫРАЗИТЬ(ВозвратДенегОтПФКонтрагенты.ЗачисленнаяСумма / 2 КАК ЧИСЛО(15, 2)) КАК СуммаКонтрагента,
		|	ВозвратДенегОтПФКонтрагенты.ЗачисленнаяСумма - (ВЫРАЗИТЬ(ВозвратДенегОтПФКонтрагенты.ЗачисленнаяСумма / 2 КАК ЧИСЛО(15, 2))) КАК СуммаОрганизации,
		|	ВозвратДенегОтПФКонтрагенты.СуммаНДФЛ КАК СуммаНДФЛКонтрагента,
		|	ВозвратДенегОтПФКонтрагенты.ВидУдержанияНДФЛ.ВидНалога.СчетУчетаРегл КАК ВидУдержанияНДФЛСчет
		|ПОМЕСТИТЬ Контрагенты
		|ИЗ
		|	Документ.ВозвратДенегОтПФ.Контрагенты КАК ВозвратДенегОтПФКонтрагенты
		|ГДЕ
		|	ВозвратДенегОтПФКонтрагенты.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шапка.Регистратор,
		|	Шапка.Период,
		|	Шапка.Организация,
		|	Сотрудники.Подразделение КАК СтруктурнаяЕдиница,
		|	Шапка.СчетДохода.СчетАналогУУ КАК СчетУчета,
		|	Шапка.СчетДохода КАК СчетУчетаРегл,
		|	СУММА(Сотрудники.СуммаОрганизации) КАК СуммаДоходов,
		|	&СодержаниеПроводки,
		|	Шапка.ХозяйственнаяОперация
		|ИЗ
		|	Шапка КАК Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Сотрудники КАК Сотрудники
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	Шапка.Организация,
		|	Шапка.Регистратор,
		|	Шапка.Период,
		|	Сотрудники.Подразделение,
		|	Шапка.СчетДохода,
		|	Шапка.СчетДохода.СчетАналогУУ,
		|	Шапка.ХозяйственнаяОперация
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Шапка.Регистратор,
		|	Шапка.Период,
		|	Шапка.Организация,
		|	Контрагенты.Подразделение,
		|	Шапка.СчетДохода.СчетАналогУУ,
		|	Шапка.СчетДохода,
		|	СУММА(Контрагенты.СуммаОрганизации),
		|	&СодержаниеПроводки,
		|	Шапка.ХозяйственнаяОперация
		|ИЗ
		|	Шапка КАК Шапка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Контрагенты КАК Контрагенты
		|		ПО (ИСТИНА)
		|
		|СГРУППИРОВАТЬ ПО
		|	Шапка.Регистратор,
		|	Шапка.Период,
		|	Шапка.Организация,
		|	Контрагенты.Подразделение,
		|	Шапка.СчетДохода,
		|	Шапка.СчетДохода.СчетАналогУУ,
		|	Шапка.ХозяйственнаяОперация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Шапка.Регистратор,
		|	Шапка.Период,
		|	Шапка.Организация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные) КАК ТипДенежныхСредств,
		|	Шапка.СчетОрганизации КАК БанковскийСчетКасса,
		|	&ВалютаРег КАК Валюта,
		|	Шапка.Сумма,
		|	Шапка.Сумма КАК СуммаВал,
		|	&СодержаниеПроводки,
		|	Шапка.СтатьяДвиженияДенежныхСредств КАК Статья,
		|	Шапка.ХозяйственнаяОперация,
		|	Шапка.КонтрагентПФ КАК Аналитика
		|ИЗ
		|	Шапка КАК Шапка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&Организация,
		|	Сотрудники.Подразделение КАК СтруктурнаяЕдиница,
		|	Сотрудники.Сотрудник,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	&ВалютаРег КАК Валюта,
		|	Сотрудники.ВидРасчета КАК ВидНачисленияУдержания,
		|	СУММА(Сотрудники.СуммаСотрудника) КАК Сумма,
		|	СУММА(Сотрудники.СуммаСотрудника) КАК СуммаВал,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК ДатаНачала,
		|	КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ) КАК ДатаОкончания,
		|	СУММА(Сотрудники.СуммаСотрудника) КАК Размер
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.ВидРасчета,
		|	Сотрудники.Сотрудник,
		|	Сотрудники.Подразделение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Дата,
		|	&Ссылка,
		|	&Организация,
		|	Сотрудники.Подразделение,
		|	Сотрудники.Сотрудник,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ),
		|	&ВалютаРег,
		|	Сотрудники.ВидУдержанияНДФЛ,
		|	СУММА(Сотрудники.СуммаНДФЛСотрудника),
		|	СУММА(Сотрудники.СуммаНДФЛСотрудника),
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ),
		|	КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ),
		|	СУММА(0)
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.СуммаНДФЛСотрудника = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Сотрудник,
		|	Сотрудники.Подразделение,
		|	Сотрудники.ВидУдержанияНДФЛ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
		|	&Организация,
		|	Сотрудники.ВидУдержанияНДФЛ.ВидНалога КАК ВидНалога,
		|	Сотрудники.СуммаНДФЛСотрудника КАК Сумма,
		|	&НачислениеНДФЛ КАК СодержаниеПроводки
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.СуммаНДФЛ = 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Дата,
		|	&Ссылка,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
		|	&Организация,
		|	Контрагенты.ВидУдержанияНДФЛ.ВидНалога,
		|	Контрагенты.СуммаНДФЛКонтрагента,
		|	&НачислениеНДФЛ
		|ИЗ
		|	Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.СуммаНДФЛ = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&Организация,
		|	Сотрудники.Подразделение КАК СтруктурнаяЕдиница,
		|	Сотрудники.Сотрудник,
		|	&ВалютаРег КАК Валюта,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	СУММА(Сотрудники.СуммаСотрудника) КАК Сумма,
		|	СУММА(Сотрудники.СуммаСотрудника) КАК СуммаВал,
		|	&НачислениеЗарплаты КАК СодержаниеПроводки
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Сотрудник,
		|	Сотрудники.Подразделение
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Дата,
		|	&Ссылка,
		|	&Организация,
		|	Сотрудники.Подразделение,
		|	Сотрудники.Сотрудник,
		|	&ВалютаРег,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ),
		|	СУММА(-Сотрудники.СуммаНДФЛСотрудника),
		|	СУММА(-Сотрудники.СуммаНДФЛСотрудника),
		|	&НачислениеНДФЛ
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.СуммаНДФЛСотрудника = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Сотрудник,
		|	Сотрудники.Подразделение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&Организация КАК Организация,
		|	ЗНАЧЕНИЕ(Перечисление.ТипыРасчетов.Долг) КАК ТипРасчетов,
		|	Контрагенты.Контрагент,
		|	Контрагенты.ДоговорКонтрагента КАК Договор,
		|	ВЫБОР
		|		КОГДА Контрагенты.Контрагент.ВестиРасчетыПоДокументам
		|			ТОГДА &Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ КАК Документ,
		|	СУММА(Контрагенты.СуммаКонтрагента - Контрагенты.СуммаНДФЛКонтрагента) КАК Сумма,
		|	СУММА(Контрагенты.СуммаКонтрагента - Контрагенты.СуммаНДФЛКонтрагента) КАК СуммаВал,
		|	&ВозникновениеОбязательствПередПоставщиком КАК СодержаниеПроводки,
		|	&ХозяйственнаяОперация КАК ХозяйственнаяОперация
		|ИЗ
		|	Контрагенты КАК Контрагенты
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.ДоговорКонтрагента,
		|	Контрагенты.Контрагент,
		|	ВЫБОР
		|		КОГДА Контрагенты.Контрагент.ВестиРасчетыПоДокументам
		|			ТОГДА &Ссылка
		|		ИНАЧЕ НЕОПРЕДЕЛЕНО
		|	КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&Дата КАК Период,
		|	&Ссылка КАК Регистратор,
		|	&Организация,
		|	Сотрудники.ВидУдержанияНДФЛ КАК ВидНачисленияУдержания,
		|	Сотрудники.Сотрудник КАК Сотрудник,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) КАК ПериодРегистрации,
		|	&ВалютаРег КАК Валюта,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный) КАК Операция,
		|	СУММА(Сотрудники.СуммаНДФЛСотрудника) КАК Сумма,
		|	СУММА(Сотрудники.СуммаНДФЛСотрудника) КАК СуммаВал,
		|	&СодержаниеПроводки
		|ИЗ
		|	Сотрудники КАК Сотрудники
		|ГДЕ
		|	НЕ Сотрудники.СуммаНДФЛСотрудника = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Сотрудники.Сотрудник,
		|	Сотрудники.ВидУдержанияНДФЛ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Дата,
		|	&Ссылка,
		|	&Организация,
		|	Контрагенты.ВидУдержанияНДФЛ,
		|	Контрагенты.Контрагент,
		|	НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ),
		|	&ВалютаРег,
		|	ЗНАЧЕНИЕ(Перечисление.ОперацииПФ.Начисленный),
		|	Контрагенты.СуммаНДФЛКонтрагента,
		|	Контрагенты.СуммаНДФЛКонтрагента,
		|	&СодержаниеПроводки
		|ИЗ
		|	Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.СуммаНДФЛКонтрагента = 0
		|
		|СГРУППИРОВАТЬ ПО
		|	Контрагенты.ВидУдержанияНДФЛ,
		|	Контрагенты.СуммаНДФЛКонтрагента,
		|	Контрагенты.Контрагент,
		|	Контрагенты.СуммаНДФЛКонтрагента";
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("Дата", 					Дата);
	Запрос.УстановитьПараметр("Организация",			Организация);
	Запрос.УстановитьПараметр("ВалютаРег", 				мВалютаРегламентированногоУчета);
	Запрос.УстановитьПараметр("ХозяйственнаяОперация",	УправлениеНебольшойФирмойПовтИсп.ПолучитьПредопределенноеЗначениеСправочника("ХозяйственныеОперации","ВозвратДенегОтПФ"));
	Запрос.УстановитьПараметр("СодержаниеПроводки",							НСТР("ka='საპენსიოდან თანხის დაბრუნება';ru='Поступление от ПФ'"));
	Запрос.УстановитьПараметр("НачислениеЗарплаты",							НСТР("ka='ხელფასის დარიცხვა';ru='Начисление зарплаты'"));
	Запрос.УстановитьПараметр("НачислениеНДФЛ",								НСТР("ka='საშემოსავლოს დარიცხვა';ru='Начисление НДФЛ'"));
	Запрос.УстановитьПараметр("ВозникновениеОбязательствПередПоставщиком", 	НСтр("ka='მომწოდებლის წინაშე ვალდებულებების წარმოშობა';ru='Возникновение обязательств перед поставщиком'"));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СделатьПроводкуВРегистр(РезультатЗапроса[3].Выгрузить(),  "ДоходыИРасходы", 		Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СделатьПроводкуВРегистр(РезультатЗапроса[4].Выгрузить(),  "ДенежныеСредства", 		Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СделатьПроводкуВРегистр(РезультатЗапроса[5].Выгрузить(),  "НачисленияИУдержания", 	Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СделатьПроводкуВРегистр(РезультатЗапроса[6].Выгрузить(),  "РасчетыПоНалогам", 		Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СделатьПроводкуВРегистр(РезультатЗапроса[7].Выгрузить(),  "РасчетыСПерсоналом", 	Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СделатьПроводкуВРегистр(РезультатЗапроса[8].Выгрузить(),  "РасчетыСПоставщиками", 	Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СделатьПроводкуВРегистр(РезультатЗапроса[9].Выгрузить(),  "РасчетыНДФЛ", 			Движения, Отказ);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ВозвратДенегОтПФ(МВТ, Ссылка, Организация, Дата, Движения, мВалютаРегламентированногоУчета, Отказ);
	
КонецПроцедуры
